doc/sablona2020/projekt.tex
% Created 2021-02-06 Sat 20:20
% Intended LaTeX compiler: pdflatex
\documentclass[english,zadani,odsaz]{fitthesis}
\renewcommand\title[1]{}
\usepackage{minted}
\usepackage[figure,table,listing]{totalcount}
\input{metadata}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.50 (Org mode 9.3)}, 
 pdflang={English}}
\begin{document}

% * (front matter)                                              :ignoreheading:
\maketitle
\setlength{\parskip}{0pt}
{\hypersetup{hidelinks}\tableofcontents}
\iftotalfigures\listoffigures\fi
\iftotaltables\listoftables\fi
\iftotallistings\listoflistings\fi
\iftwoside\cleardoublepage\fi
\setlength{\parskip}{0.5\bigskipamount}

\chapter{Úvod}
\label{sec:org287e116}
\chapter{Partial evaluation/JIT/Futamura}
\label{sec:org64cac04}
\chapter{JIT principles}
\label{sec:org49af6be}
\chapter{GraalVM/Truffle}
\label{sec:org65567bb}
\chapter{Dependently-Typed Lambda Calculus}
\label{sec:org378c19a}
\chapter{LambdaPi specification}
\label{sec:org7182857}
\chapter{LambdaPi Interpreter}
\label{sec:org9c2ae1f}
\chapter{Truffle-based compiler}
\label{sec:org0e9198f}
\chapter{LLVM-based compiler}
\label{sec:orgbdb622a}
\chapter{Benchmarks}
\label{sec:org5386c90}
\chapter{Evaluation}
\label{sec:orgd17bf8e}

% * (bibliography, start of appendix)                           :ignoreheading:
\makeatletter
\def\@openbib@code{\addcontentsline{toc}{chapter}{Bibliography}}
\makeatother
\bibliographystyle{bib-styles/Pysny/enplain}

\begin{flushleft}
\bibliography{projekt-20-literatura-bibliography}
\end{flushleft}
\iftwoside\cleardoublepage\fi

% Appendices
\appendix
\appendixpage
\iftwoside\cleardoublepage\fi

\startcontents[chapters]
% \setlength{\parskip}{0pt}
% \printcontents[chapters]{l}{0}{\setcounter{tocdepth}{2}}
% \setlength{\parskip}{0.5\bigskipamount}
\iftwoside\cleardoublepage\fi

\chapter{Contents of the attached data storage}
\label{sec:org01ce501}
\ldots{}
\end{document}